shangdawei/FT232R_Emulator/MCU/STM32F0XX/Library/CMSIS/stm32f0xx_4.h

/******************************************************************************/
/*                                                                            */
/*                 External Interrupt/Event Controller (EXTI)                 */
/*                                                                            */
/******************************************************************************/


/******  EXTI_IMR_IM Definition ******************************************************************************/
#define EXTI_IMR_IM_Pos           (0U)

#if defined(STM32F030x6)
#define EXTI_IMR_IM_Msk           (0x8EFFFFU << EXTI_IMR_IM_Pos)               /*!< 0x008EFFFF */
#elif defined(STM32F030x8)
#define EXTI_IMR_IM_Msk           (0x8EFFFFU << EXTI_IMR_IM_Pos)               /*!< 0x008EFFFF */
#elif defined(STM32F030xC)
#define EXTI_IMR_IM_Msk           (0x9EFFFFU << EXTI_IMR_IM_Pos)               /*!< 0x009EFFFF */
#elif defined(STM32F031x6)
#define EXTI_IMR_IM_Msk           (0xAEFFFFFU << EXTI_IMR_IM_Pos)              /*!< 0x0AEFFFFF */
#elif defined(STM32F038xx)
#define EXTI_IMR_IM_Msk           (0xAEFFFFFU << EXTI_IMR_IM_Pos)              /*!< 0x0AEFFFFF */
#elif defined(STM32F042x6)
#define EXTI_IMR_IM_Msk           (0x8AEFFFFFU << EXTI_IMR_IM_Pos)             /*!< 0x8AEFFFFF */
#elif defined(STM32F048xx)
#define EXTI_IMR_IM_Msk           (0x8AEFFFFFU << EXTI_IMR_IM_Pos)             /*!< 0x8AEFFFFF */
#elif defined(STM32F051x8)
#define EXTI_IMR_IM_Msk           (0xAEFFFFFU << EXTI_IMR_IM_Pos)              /*!< 0x0AEFFFFF */
#elif defined(STM32F058xx)
#define EXTI_IMR_IM_Msk           (0xAEFFFFFU << EXTI_IMR_IM_Pos)              /*!< 0x0AEFFFFF */
#elif defined(STM32F070x6)
#define EXTI_IMR_IM_Msk           (0x8EFFFFU << EXTI_IMR_IM_Pos)               /*!< 0x008EFFFF */
#elif defined(STM32F070xB)
#define EXTI_IMR_IM_Msk           (0x9EFFFFU << EXTI_IMR_IM_Pos)               /*!< 0x009EFFFF */
#elif defined(STM32F071xB)
#define EXTI_IMR_IM_Msk           (0x8EFFFFFFU << EXTI_IMR_IM_Pos)             /*!< 0x8EFFFFFF */
#elif defined(STM32F072xB)
#define EXTI_IMR_IM_Msk           (0x8EFFFFFFU << EXTI_IMR_IM_Pos)             /*!< 0x8EFFFFFF */
#elif defined(STM32F078xx)
#define EXTI_IMR_IM_Msk           (0x8EFFFFFFU << EXTI_IMR_IM_Pos)             /*!< 0x8EFFFFFF */
#elif defined(STM32F091xC)
#define EXTI_IMR_IM_Msk           (0x9EFFFFFFU << EXTI_IMR_IM_Pos)             /*!< 0x9EFFFFFF */
#elif defined(STM32F098xx)
#define EXTI_IMR_IM_Msk           (0x9EFFFFFFU << EXTI_IMR_IM_Pos)             /*!< 0x9EFFFFFF */
#endif

#define EXTI_IMR_IM               EXTI_IMR_IM_Msk                              /*!< Interrupt Mask All */

/*******************  Bit definition for EXTI_IMR register  *******************/
#define EXTI_IMR_MR0_Pos          (0U)
#define EXTI_IMR_MR0_Msk          (0x1U << EXTI_IMR_MR0_Pos)                   /*!< 0x00000001 */
#define EXTI_IMR_MR0              EXTI_IMR_MR0_Msk                             /*!< Interrupt Mask on line 0  */
#define EXTI_IMR_MR1_Pos          (1U)
#define EXTI_IMR_MR1_Msk          (0x1U << EXTI_IMR_MR1_Pos)                   /*!< 0x00000002 */
#define EXTI_IMR_MR1              EXTI_IMR_MR1_Msk                             /*!< Interrupt Mask on line 1  */
#define EXTI_IMR_MR2_Pos          (2U)
#define EXTI_IMR_MR2_Msk          (0x1U << EXTI_IMR_MR2_Pos)                   /*!< 0x00000004 */
#define EXTI_IMR_MR2              EXTI_IMR_MR2_Msk                             /*!< Interrupt Mask on line 2  */
#define EXTI_IMR_MR3_Pos          (3U)
#define EXTI_IMR_MR3_Msk          (0x1U << EXTI_IMR_MR3_Pos)                   /*!< 0x00000008 */
#define EXTI_IMR_MR3              EXTI_IMR_MR3_Msk                             /*!< Interrupt Mask on line 3  */
#define EXTI_IMR_MR4_Pos          (4U)
#define EXTI_IMR_MR4_Msk          (0x1U << EXTI_IMR_MR4_Pos)                   /*!< 0x00000010 */
#define EXTI_IMR_MR4              EXTI_IMR_MR4_Msk                             /*!< Interrupt Mask on line 4  */
#define EXTI_IMR_MR5_Pos          (5U)
#define EXTI_IMR_MR5_Msk          (0x1U << EXTI_IMR_MR5_Pos)                   /*!< 0x00000020 */
#define EXTI_IMR_MR5              EXTI_IMR_MR5_Msk                             /*!< Interrupt Mask on line 5  */
#define EXTI_IMR_MR6_Pos          (6U)
#define EXTI_IMR_MR6_Msk          (0x1U << EXTI_IMR_MR6_Pos)                   /*!< 0x00000040 */
#define EXTI_IMR_MR6              EXTI_IMR_MR6_Msk                             /*!< Interrupt Mask on line 6  */
#define EXTI_IMR_MR7_Pos          (7U)
#define EXTI_IMR_MR7_Msk          (0x1U << EXTI_IMR_MR7_Pos)                   /*!< 0x00000080 */
#define EXTI_IMR_MR7              EXTI_IMR_MR7_Msk                             /*!< Interrupt Mask on line 7  */
#define EXTI_IMR_MR8_Pos          (8U)
#define EXTI_IMR_MR8_Msk          (0x1U << EXTI_IMR_MR8_Pos)                   /*!< 0x00000100 */
#define EXTI_IMR_MR8              EXTI_IMR_MR8_Msk                             /*!< Interrupt Mask on line 8  */
#define EXTI_IMR_MR9_Pos          (9U)
#define EXTI_IMR_MR9_Msk          (0x1U << EXTI_IMR_MR9_Pos)                   /*!< 0x00000200 */
#define EXTI_IMR_MR9              EXTI_IMR_MR9_Msk                             /*!< Interrupt Mask on line 9  */
#define EXTI_IMR_MR10_Pos         (10U)
#define EXTI_IMR_MR10_Msk         (0x1U << EXTI_IMR_MR10_Pos)                  /*!< 0x00000400 */
#define EXTI_IMR_MR10             EXTI_IMR_MR10_Msk                            /*!< Interrupt Mask on line 10 */
#define EXTI_IMR_MR11_Pos         (11U)
#define EXTI_IMR_MR11_Msk         (0x1U << EXTI_IMR_MR11_Pos)                  /*!< 0x00000800 */
#define EXTI_IMR_MR11             EXTI_IMR_MR11_Msk                            /*!< Interrupt Mask on line 11 */
#define EXTI_IMR_MR12_Pos         (12U)
#define EXTI_IMR_MR12_Msk         (0x1U << EXTI_IMR_MR12_Pos)                  /*!< 0x00001000 */
#define EXTI_IMR_MR12             EXTI_IMR_MR12_Msk                            /*!< Interrupt Mask on line 12 */
#define EXTI_IMR_MR13_Pos         (13U)
#define EXTI_IMR_MR13_Msk         (0x1U << EXTI_IMR_MR13_Pos)                  /*!< 0x00002000 */
#define EXTI_IMR_MR13             EXTI_IMR_MR13_Msk                            /*!< Interrupt Mask on line 13 */
#define EXTI_IMR_MR14_Pos         (14U)
#define EXTI_IMR_MR14_Msk         (0x1U << EXTI_IMR_MR14_Pos)                  /*!< 0x00004000 */
#define EXTI_IMR_MR14             EXTI_IMR_MR14_Msk                            /*!< Interrupt Mask on line 14 */
#define EXTI_IMR_MR15_Pos         (15U)
#define EXTI_IMR_MR15_Msk         (0x1U << EXTI_IMR_MR15_Pos)                  /*!< 0x00008000 */
#define EXTI_IMR_MR15             EXTI_IMR_MR15_Msk                            /*!< Interrupt Mask on line 15 */
#define EXTI_IMR_MR16_Pos         (16U)
#define EXTI_IMR_MR16_Msk         (0x1U << EXTI_IMR_MR16_Pos)                  /*!< 0x00010000 */
#define EXTI_IMR_MR16             EXTI_IMR_MR16_Msk                            /*!< Interrupt Mask on line 16 */
#define EXTI_IMR_MR17_Pos         (17U)
#define EXTI_IMR_MR17_Msk         (0x1U << EXTI_IMR_MR17_Pos)                  /*!< 0x00020000 */
#define EXTI_IMR_MR17             EXTI_IMR_MR17_Msk                            /*!< Interrupt Mask on line 17 */
#define EXTI_IMR_MR18_Pos         (18U)
#define EXTI_IMR_MR18_Msk         (0x1U << EXTI_IMR_MR18_Pos)                  /*!< 0x00040000 */
#define EXTI_IMR_MR18             EXTI_IMR_MR18_Msk                            /*!< Interrupt Mask on line 18 */
#define EXTI_IMR_MR19_Pos         (19U)
#define EXTI_IMR_MR19_Msk         (0x1U << EXTI_IMR_MR19_Pos)                  /*!< 0x00080000 */
#define EXTI_IMR_MR19             EXTI_IMR_MR19_Msk                            /*!< Interrupt Mask on line 19 */
#define EXTI_IMR_MR20_Pos         (20U)
#define EXTI_IMR_MR20_Msk         (0x1U << EXTI_IMR_MR20_Pos)                  /*!< 0x00100000 */
#define EXTI_IMR_MR20             EXTI_IMR_MR20_Msk                            /*!< Interrupt Mask on line 20 */
#define EXTI_IMR_MR21_Pos         (21U)
#define EXTI_IMR_MR21_Msk         (0x1U << EXTI_IMR_MR21_Pos)                  /*!< 0x00200000 */
#define EXTI_IMR_MR21             EXTI_IMR_MR21_Msk                            /*!< Interrupt Mask on line 21 */
#define EXTI_IMR_MR22_Pos         (22U)
#define EXTI_IMR_MR22_Msk         (0x1U << EXTI_IMR_MR22_Pos)                  /*!< 0x00400000 */
#define EXTI_IMR_MR22             EXTI_IMR_MR22_Msk                            /*!< Interrupt Mask on line 22 */
#define EXTI_IMR_MR23_Pos         (23U)
#define EXTI_IMR_MR23_Msk         (0x1U << EXTI_IMR_MR23_Pos)                  /*!< 0x00800000 */
#define EXTI_IMR_MR23             EXTI_IMR_MR23_Msk                            /*!< Interrupt Mask on line 23 */
#define EXTI_IMR_MR25_Pos         (25U)
#define EXTI_IMR_MR25_Msk         (0x1U << EXTI_IMR_MR25_Pos)                  /*!< 0x02000000 */
#define EXTI_IMR_MR25             EXTI_IMR_MR25_Msk                            /*!< Interrupt Mask on line 25 */
#define EXTI_IMR_MR26_Pos         (26U)
#define EXTI_IMR_MR26_Msk         (0x1U << EXTI_IMR_MR26_Pos)                  /*!< 0x04000000 */
#define EXTI_IMR_MR26             EXTI_IMR_MR26_Msk                            /*!< Interrupt Mask on line 26 */
#define EXTI_IMR_MR27_Pos         (27U)
#define EXTI_IMR_MR27_Msk         (0x1U << EXTI_IMR_MR27_Pos)                  /*!< 0x08000000 */
#define EXTI_IMR_MR27             EXTI_IMR_MR27_Msk                            /*!< Interrupt Mask on line 27 */
#define EXTI_IMR_MR28_Pos         (28U)
#define EXTI_IMR_MR28_Msk         (0x1U << EXTI_IMR_MR28_Pos)                  /*!< 0x10000000 */
#define EXTI_IMR_MR28             EXTI_IMR_MR28_Msk                            /*!< Interrupt Mask on line 28 */
#define EXTI_IMR_MR31_Pos         (31U)
#define EXTI_IMR_MR31_Msk         (0x1U << EXTI_IMR_MR31_Pos)                  /*!< 0x80000000 */
#define EXTI_IMR_MR31             EXTI_IMR_MR31_Msk                            /*!< Interrupt Mask on line 31 */

/* References Defines */
#define  EXTI_IMR_IM0  						EXTI_IMR_MR0
#define  EXTI_IMR_IM1  						EXTI_IMR_MR1
#define  EXTI_IMR_IM2  						EXTI_IMR_MR2
#define  EXTI_IMR_IM3  						EXTI_IMR_MR3
#define  EXTI_IMR_IM4  						EXTI_IMR_MR4
#define  EXTI_IMR_IM5  						EXTI_IMR_MR5
#define  EXTI_IMR_IM6  						EXTI_IMR_MR6
#define  EXTI_IMR_IM7  						EXTI_IMR_MR7
#define  EXTI_IMR_IM8  						EXTI_IMR_MR8
#define  EXTI_IMR_IM9  						EXTI_IMR_MR9
#define  EXTI_IMR_IM10 						EXTI_IMR_MR10
#define  EXTI_IMR_IM11 						EXTI_IMR_MR11
#define  EXTI_IMR_IM12 						EXTI_IMR_MR12
#define  EXTI_IMR_IM13 						EXTI_IMR_MR13
#define  EXTI_IMR_IM14 						EXTI_IMR_MR14
#define  EXTI_IMR_IM15 						EXTI_IMR_MR15
#define  EXTI_IMR_IM16 						EXTI_IMR_MR16
#define  EXTI_IMR_IM17 						EXTI_IMR_MR17
#define  EXTI_IMR_IM18 						EXTI_IMR_MR18
#define  EXTI_IMR_IM19 						EXTI_IMR_MR19
#define  EXTI_IMR_IM20 						EXTI_IMR_MR20
#define  EXTI_IMR_IM21 						EXTI_IMR_MR21
#define  EXTI_IMR_IM22 						EXTI_IMR_MR22
#define  EXTI_IMR_IM23 						EXTI_IMR_MR23
#define  EXTI_IMR_IM25 						EXTI_IMR_MR25
#define  EXTI_IMR_IM26 						EXTI_IMR_MR26
#define  EXTI_IMR_IM27 						EXTI_IMR_MR27
#define  EXTI_IMR_IM28 						EXTI_IMR_MR28
#define  EXTI_IMR_IM31 						EXTI_IMR_MR31

